Revit 2027 API
Hardwood.HardwoodApplication Property
 The property labeled "Used For" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodApplication { get; }
Public Shared ReadOnly Property HardwoodApplication As String
	Get
public:
static property String^ HardwoodApplication {
	String^ get ();
}
static member HardwoodApplication : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodApplicationType".
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace